lv_cfd_anatomical/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-0.095  -0.035  -0.220)
    ( 0.020  -0.035  -0.220)
    ( 0.020   0.098  -0.220)
    (-0.095   0.098  -0.220)
    (-0.095  -0.035  -0.100)
    ( 0.020  -0.035  -0.100)
    ( 0.020   0.098  -0.100)
    (-0.095   0.098  -0.100)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (46 53 48) simpleGrading (1 1 1)
);

boundary
(
    allBoundary
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 1 5 4)
            (0 4 7 3)
            (1 2 6 5)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
