lv_cfd_anatomical/system/createPatchDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

pointSync   false;

patches
(
    {
        name            mitralInlet;
        patchInfo
        {
            type    patch;
        }
        constructFrom   set;
        set             mitralFaces;
    }
    {
        name            aorticOutlet;
        patchInfo
        {
            type    patch;
        }
        constructFrom   set;
        set             aorticFaces;
    }
);
