lv_cfd_anatomical/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    lvWall
    {
        type            zeroGradient;
    }

    mitralInlet
    {
        type            zeroGradient;
    }

    aorticOutlet
    {
        // Reference pressure
        type            fixedValue;
        value           uniform 0;
    }
}
