lv_cfd_anatomical/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.01;
        minIter         1;
    }
    pFinal
    {
        $p;
        relTol          0;
    }
    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.01;
    }
    UFinal
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors    2;
    nCorrectors         3;
    nNonOrthogonalCorrectors 3;
    pRefCell            0;
    pRefValue           0;
}

relaxationFactors
{
    fields
    {
        p               0.3;
        pFinal          1.0;
    }
    equations
    {
        U               0.7;
        UFinal          1.0;
    }
}
