lv_cfd_anatomical/system/fvConstraints
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvConstraints;
}

limitU
{
    type            limitVelocity;
    active          yes;
    selectionMode   all;
    max             5.0;
}
